<?php
    $arrayMonth = [
        [
            1 => 'Январь',
            2 => 'Февраль',
            3 => 'Март'
        ],
        [
            1 => 'Апрель',
            2 => 'Май',
            3 => 'Июнь'
        ],
        [
            1 => 'Июль',
            2 => 'Август',
            3 => 'Сентябрь'
        ],
        [
            1 => 'Октябрь',
            2 => 'Ноябрь',
            3 => 'Декабрь'
        ]
    ];

    for ($i = 0, $month = 1; $i < 4; $i++) {
        for ($j = 1; $j < 4; $j++ and $month++) {
            echo 'Месяц №'.$month.' - '.$arrayMonth[$i][$j]."\n";
        }
    }